### Titanic

- PassengerId : 탑승객의 고유 아이디
- Survival : 생존여부(0: 사망, 1: 생존)
- Pclass : 등실의 등급(1: 1등급, 2: 2등급, 3: 3등급)
- Name : 이름
- Sex : 성별
- Age : 나이
- Sibsp : 함께 탑승한 형제자매, 아내 남편의 수
- Parch: 함께 탑승한 부모, 자식의 수
- Ticket: 티켓번호
- Fare: 티켓의 요금
- Cabin: 객실번호
- Embarked: 배에 탑승한 위치(C = Cherbourg, Q = Queenstown, S = Southampton)

In [160]:
# 현재 경로
import os
print(os.getcwd())

/home/ubuntu/titanic_data

In [161]:
# 데이터 불러오기
import pandas as pd

train = pd.read_csv("train.csv")

In [162]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

일단 object 타입 중 Sex, Ticket, Cabin은 다루지 않을 예정이므로 컬럼에서 제거한다.

In [163]:
train1 = train.drop(['Cabin','Sex','Ticket'], axis=1)

상관관계를 알아보기에 앞서 Embarked를 0~2 값을 가지는 범주형 및 정수타입으로 변환해주고, 동시에 Embarked null인 2개의 결측값을 제거해주자.

In [164]:
train2 = train1.dropna(subset=['Embarked'])

In [165]:
train2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Name         889 non-null    object
 4   Age          712 non-null    float64
 5   SibSp        889 non-null    int64
 6   Parch        889 non-null    int64
 7   Fare         889 non-null    float64
 8   Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(2)
memory usage: 69.5+ KB

In [166]:
import copy
train2 = train2.copy()
train2.loc[train2['Embarked'] == 'C','Embarked']=0
train2.loc[train2['Embarked'] == 'Q','Embarked']=1
train2.loc[train2['Embarked'] == 'S','Embarked']=2

In [167]:
train2['Embarked'] = train2['Embarked'].astype(int)

In [168]:
train2.head(5)

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,7.2500,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,71.2833,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,7.9250,2
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,53.1000,2
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,8.0500,2

Survived와 가장 상관관계가 있는 컬럼 찾아보기

In [169]:
train2.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Embarked
PassengerId,1.000000,-0.005028,-0.035330,0.033681,-0.057686,-0.001657,0.012703,0.013166
Survived,-0.005028,1.000000,-0.335549,-0.082446,-0.034040,0.083151,0.255290,-0.169718
Pclass,-0.035330,-0.335549,1.000000,-0.365902,0.081656,0.016824,-0.548193,0.164681
Age,0.033681,-0.082446,-0.365902,1.000000,-0.307351,-0.187896,0.093143,-0.032565
SibSp,-0.057686,-0.034040,0.081656,-0.307351,1.000000,0.414542,0.160887,0.068900
Parch,-0.001657,0.083151,0.016824,-0.187896,0.414542,1.000000,0.217532,0.040449
Fare,0.012703,0.255290,-0.548193,0.093143,0.160887,0.217532,1.000000,-0.226311
Embarked,0.013166,-0.169718,0.164681,-0.032565,0.068900,0.040449,-0.226311,1.000000

Survived와 가장 상관계수가 높은 Pclass와 Fare, Embarked 만을 남기고 나머지 컬럼은 삭제한다. (승객 이름은 남김)

In [170]:
train3 = train2.drop(['SibSp','Parch','Age','PassengerId'], axis=1)

In [171]:
train3.head(5)

,Survived,Pclass,Name,Fare,Embarked
0,0,3,"Braund, Mr. Owen Harris",7.2500,2
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",71.2833,0
2,1,3,"Heikkinen, Miss. Laina",7.9250,2
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",53.1000,2
4,0,3,"Allen, Mr. William Henry",8.0500,2

등실의 등급에 따른 생존 확률 구하기

In [172]:
train_class = train3.drop(['Fare','Embarked'], axis=1)
train_class

     Survived  Pclass                                               Name
0           0       3                            Braund, Mr. Owen Harris
1           1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2           1       3                             Heikkinen, Miss. Laina
3           1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4           0       3                           Allen, Mr. William Henry
..        ...     ...                                                ...
886         0       2                              Montvila, Rev. Juozas
887         1       1                       Graham, Miss. Margaret Edith
888         0       3           Johnston, Miss. Catherine Helen "Carrie"
889         1       1                              Behr, Mr. Karl Howell
890         0       3                                Dooley, Mr. Patrick

[889 rows x 3 columns]

In [173]:
train_class['Pclass'].value_counts()

3    491
1    214
2    184
Name: Pclass, dtype: int64

In [193]:
train_survived = train_class[train_class['Survived'] == 1]

train_survived['Pclass'].value_counts()

1    134
3    119
2     87
Name: Pclass, dtype: int64

In [194]:
train_class1 = train_class[train_class['Pclass'] == 1]
train_class2 = train_class[train_class['Pclass'] == 2]
train_class3 = train_class[train_class['Pclass'] == 3]

In [197]:
train_class1.reset_index()  # 리뎃 인덱스 질문

train_class1.head(5)

    Survived  Pclass                                               Name
1          1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
3          1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)
6          0       1                            McCarthy, Mr. Timothy J
11         1       1                           Bonnell, Miss. Elizabeth
23         1       1                       Sloper, Mr. William Thompson

In [192]:
train_class2.head(5)

    Survived  Pclass                                 Name
9          1       2  Nasser, Mrs. Nicholas (Adele Achem)
15         1       2     Hewlett, Mrs. (Mary D Kingcome)
17         1       2         Williams, Mr. Charles Eugene
20         0       2                 Fynney, Mr. Joseph J
21         1       2                Beesley, Mr. Lawrence

In [178]:
train_class3.head(5)

   Survived  Pclass                            Name
0         0       3         Braund, Mr. Owen Harris
2         1       3          Heikkinen, Miss. Laina
4         0       3        Allen, Mr. William Henry
5         0       3                Moran, Mr. James
7         0       3  Palsson, Master. Gosta Leonard

티켓 요금에 따른 생존 확률 구하기

In [181]:
train_fare = train3.drop(['Pclass','Embarked'], axis=1)

In [182]:
train_fare.head(5)

   Survived                                               Name     Fare
0         0                            Braund, Mr. Owen Harris   7.2500
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...  71.2833
2         1                             Heikkinen, Miss. Laina   7.9250
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  53.1000
4         0                           Allen, Mr. William Henry   8.0500

In [183]:
train_fare.describe()

         Survived        Fare
count  889.000000  889.000000
mean     0.382452   32.096681
std      0.486260   49.697504
min      0.000000    0.000000
25%      0.000000    7.895800
50%      0.000000   14.454200
75%      1.000000   31.000000
max      1.000000  512.329200

In [184]:
train_fare1 = train_fare[train_fare['Survived'] == 1]

In [185]:
train_fare1.describe()

       Survived        Fare
count     340.0  340.000000
mean        1.0   48.209498
std         0.0   66.748773
min         1.0    0.000000
25%         1.0   12.443750
50%         1.0   26.000000
75%         1.0   56.946900
max         1.0  512.329200

탑승 위치에 따른 생존 확률 구하기

In [186]:
train_seat = train3.drop(['Pclass','Fare'], axis=1)

In [187]:
train_seat.head(5)

   Survived                                               Name  Embarked
0         0                            Braund, Mr. Owen Harris         2
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...         0
2         1                             Heikkinen, Miss. Laina         2
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)         2
4         0                           Allen, Mr. William Henry         2